Ebiroll/qemu-stm32/hw/arm/stm32/stm32lxxx_syscfg.c
/*
 * STM32F4xx SYSCFG
 *
 * Copyright (c) 2014 Alistair Francis <alistair@alistair23.me>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
 * THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "trace.h"
#include "hw/irq.h"
#include "migration/vmstate.h"
#include "hw/arm/stm32/stm32lxxx_syscfg.h"

static void stm32lxxx_syscfg_reset(DeviceState *dev)
{
    STM32lxxxSyscfgState *s = STM32LXXX_SYSCFG(dev);

    s->syscfg_seccfgr = 0x00000000;
    s->syscfg_cfgr1 = 0x00000000;
    // 1 1 1 1 1 1
    s->syscfg_fpuimr = 0x0000003F;
    s->syscfg_cslckr = 0x00000000;
    s->syscfg_cnslckr = 0x00000000;
    s->syscfg_cfgr2 = 0x00000000;
    s->syscfg_scsr = 0x00000000;
    s->syscfg_skr = 0x00000000;
    s->syscfg_swpr = 0x00000000;
    s->syscfg_swpr2 = 0x00000000;
    s->syscfg_rsscmdr = 0x00000000;
    s->vrefbuf_csr = 0x00000000;
    s->vrefbuf_ccr = 0x00000000;
 
}

/*

static void stm32lxxx_syscfg_set_irq(void *opaque, int irq, int level)
{
    //STM32lxxxSyscfgState *s = opaque;
    int icrreg = irq / 4;
    int startbit = (irq & 3) * 4;
    uint8_t config = irq / 16;

    trace_stm32f4xx_syscfg_set_irq(irq / 16, irq % 16, level);

    g_assert(icrreg < SYSCFG_NUM_EXTICR);

    if (extract32(s->syscfg_exticr[icrreg], startbit, 4) == config) {
        qemu_set_irq(s->gpio_out[irq], level);
        trace_stm32f4xx_pulse_exti(irq);
   }
}
*/

static uint64_t stm32lxxx_syscfg_read(void *opaque, hwaddr addr,
                                     unsigned int size)
{
    STM32lxxxSyscfgState *s = opaque;

    //trace_stm32f4xx_syscfg_read(addr);

    switch (addr) {
    case SYSCFG_SECCFGR:
        return s->syscfg_seccfgr;
    case SYSCFG_CFGR1:
        return s->syscfg_cfgr1;
    case SYSCFG_FPUIMR:
        return s->syscfg_fpuimr;
    case SYSCFG_CNSLCKR:
        return s->syscfg_cslckr;
    case SYSCFG_CFGR2:
        return s->syscfg_cfgr2;
    case SYSCFG_SCSR:
        return s->syscfg_scsr;
    case SYSCFG_SKR:
        return s->syscfg_skr;
    case SYSCFG_SWPR:
        return s->syscfg_swpr;
    case SYSCFG_RSSCMDR:
        return s->syscfg_rsscmdr;
    case VREFBUF_CCR:
        return s->vrefbuf_ccr;
    case VREFBUF_CSR:
        return s->vrefbuf_csr;
    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%"HWADDR_PRIx"\n", __func__, addr);
        return 0;
    }


}

static void stm32lxxx_syscfg_write(void *opaque, hwaddr addr,
                       uint64_t val64, unsigned int size)
{
    STM32lxxxSyscfgState *s = opaque;
    uint32_t value = val64;

    //trace_stm32f4xx_syscfg_write(value, addr);

    switch (addr) {
    case SYSCFG_SECCFGR:
        s->syscfg_seccfgr = value;
        return;
    case SYSCFG_CFGR1:
        s->syscfg_cfgr1 = value;
        return;

    case SYSCFG_FPUIMR:
        s->syscfg_fpuimr = value;
        return;
    case SYSCFG_CNSLCKR:
        s->syscfg_cnslckr = value;
        return;

    case SYSCFG_CFGR2:  
        s->syscfg_cfgr2 = value;
        return;
    case SYSCFG_SCSR:
        s->syscfg_scsr = value;
        return;
    case SYSCFG_SKR:
        s->syscfg_skr = value;
        return;
    case SYSCFG_SWPR:
        s->syscfg_swpr = value;
        return;
    case SYSCFG_SWPR2:

        s->syscfg_swpr2 = value;
        return; 
    case SYSCFG_RSSCMDR:
        s->syscfg_rsscmdr = value;
        return;
    case VREFBUF_CSR:
        s->vrefbuf_csr = value | VREFBUF_CSR_VRR;
        return;
    case VREFBUF_CCR:
        s->vrefbuf_ccr = value;
        return; 

    default:
        qemu_log_mask(LOG_GUEST_ERROR,
                      "%s: Bad offset 0x%"HWADDR_PRIx"\n", __func__, addr);
    }



        /* qemu_log_mask(LOG_UNIMP,
        //              "%s: Changing the memory mapping isn't supported " \
        //              "in QEMU\n", __func__);
        */

}

static const MemoryRegionOps stm32lxxx_syscfg_ops = {
    .read = stm32lxxx_syscfg_read,
    .write = stm32lxxx_syscfg_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static void stm32lxxx_syscfg_init(Object *obj)
{
    STM32lxxxSyscfgState *s = STM32LXXX_SYSCFG(obj);

    //sysbus_init_irq(SYS_BUS_DEVICE(obj), &s->irq);

    memory_region_init_io(&s->mmio, obj, &stm32lxxx_syscfg_ops, s,
                          TYPE_STM32LXXX_SYSCFG, 0x400);
    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->mmio);

    //qdev_init_gpio_in(DEVICE(obj), stm32lxxx_syscfg_set_irq, 16 * 9);
    qdev_init_gpio_out(DEVICE(obj), s->gpio_out, 16);
}

static const VMStateDescription vmstate_stm32lxxx_syscfg = {
    .name = TYPE_STM32LXXX_SYSCFG,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_UINT32(syscfg_seccfgr, STM32lxxxSyscfgState),
        VMSTATE_UINT32(syscfg_rsscmdr, STM32lxxxSyscfgState),
        VMSTATE_END_OF_LIST()
    }
};

static void stm32lxxx_syscfg_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->reset = stm32lxxx_syscfg_reset;
    dc->vmsd = &vmstate_stm32lxxx_syscfg;
}

static const TypeInfo stm32lxxx_syscfg_info = {
    .name          = TYPE_STM32LXXX_SYSCFG,
    .parent        = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(STM32lxxxSyscfgState),
    .instance_init = stm32lxxx_syscfg_init,
    .class_init    = stm32lxxx_syscfg_class_init,
};

static void stm32lxxx_syscfg_register_types(void)
{
    type_register_static(&stm32lxxx_syscfg_info);
}

type_init(stm32lxxx_syscfg_register_types)
